Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What were these eight?

source: ཁྱིམ་དེ་རྩྭ་དང་། སྡོང་དུམ་དང་། ཚེར་མ་དང་། གསེག་མ་དང་། གྱོ་མོ་མེད་ཅིང་།
en: The residence was immaculate since all weeds, stumps, brambles, small pebbles, and gravel had been removed.

source: དྲི་མ་མེད་ལ་ཆག་ཆག་ལེགས་པར་བཏབ་པ་དང་། ཕྱག་དར་ལེགས་པར་བྱས་ཤིང་རླུང་རྡུལ་ཅན་དང་། མུན་པ་དང་། རྡུལ་དང་བྲལ་བ་དང་། སྦྲང་མ་དང་། ཤ་སྦྲང་དང་། སྦྲང་བུ་དང་། ཕྱེ་མ་ལེབ་དང་། སྡིག་སྦྲུལ་མེད་ཅིང་མེ་ཏོག་གིས་ཀུན་ཏུ་གང་བ་ལག་མཐིལ་ལྟར་མཉམ་པར་གནས་པར་གྱུར་ཏེ།
en: It was well watered and very clean. It was undisturbed by wind and free from soot and dust. There were no mosquitoes, flies, bees, or snakes. It was covered with flowers, and the area became level, like the palm of a hand.

source: འདི་ནི་སྔ་ལྟས་བྱུང་བ་དང་པོའོ།
en: This was the first omen.

source: །རིའི་རྒྱལ་པོ་གངས་རི་ལ་བྱ་འདབ་སྤེན་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་དང་། ངང་པ་དང་། རྨ་བྱ་དང་། ངུར་པ་དང་། ཀུན་ལ་དང་། ཀ་ལ་པིང་ཀ་དང་། ཤང་ཤང་ཏེའུ་ལ་སོགས་པ་སྒྲོ་གཤོག་སྣ་ཚོགས་མཛེས་པ་ཡིད་དུ་འོང་ཞིང་སྙན་པའི་སྒྲ་འབྱིན་པའི་བྱའི་ཚོགས་གང་དག་གནས་པ་དེ་དག་དེར་འོངས་ནས།
en: Flocks of birds came to the palace from the Himālayan mountains, the king of mountain ranges. There were pattraguptas, parrots, mynas, cuckoos, swans, curlews, peacocks, wild geese, kunālas, nightingales, pheasants, and many others. The birds had beautiful and delightful wings in many colors and sang in melodious sounds.

source: རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་དམ་པ་དེའི་སྟེགས་བུ་དང་། བ་གམ་དང་། རྟ་བབས་དང་། སྐར་ཁུང་དང་། བསིལ་ཁང་དང་། ཁང་པ་བརྩེགས་པ་དང་། ཁང་བཟངས་ཀྱི་སྟེང་དག་ཏུ་གནས་ཤིང་དགའ་བ་དང་། མགུ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་རང་རང་གི་སྒྲ་སྐད་དག་འབྱིན་ཏེ།
en: They perched upon the verandas, turrets, doorways, pavilions, and upper terraces of King Śuddhodana’s sublime residence. The birds were joyful and content, and they each sang happily.

source: འདི་ནི་སྔ་ལྟས་བྱུང་བ་གཉིས་པའོ།
en: This was the second omen.

source: །གང་ཡང་རྒྱལ་པོ་ཟས་གཙང་མ་དེའི་ཀུན་དགའ་ར་བ་ཉམས་དགའ་བ་དང་། ནགས་ཚལ་ཉམས་དགའ་བ་དང་། སྐྱེད་མོས་ཚལ་ཉམས་དགའ་བ་དག་ན་མེ་ཏོག་དང་འབྲས་བུའི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་དུས་ཐ་དད་པར་འབྱུང་བ། དེ་ཐམས་ཅད་ཀྱང་ཁ་འབུས་ཤིང་མེ་ཏོག་རྒྱས་པར་གྱུར་ཏེ།
en: In all of King Śuddhodana’s delightful parks, woodlands, and gardens, the various trees blossomed and carried fruits of all seasons.

source: འདི་ནི་སྔ་ལྟས་བྱུང་བ་གསུམ་པའོ།
en: This was the third omen.

source: །རྒྱལ་པོ་ཟས་གཙང་མའི་ཆུའི་ལོངས་སྤྱོད་ཀྱི་རྐྱེན་རྫིང་ལ་སོགས་པ་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་པད་མ་འདབ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་ལྡན་པ་ཚད་ཤིང་རྟའི་འཕང་ལོ་ཙམ་དག་གིས་ཁེབས་པར་གྱུར་ཏེ།
en: In each of King Śuddhodana’s lotus ponds and reservoirs, there appeared lotuses the size of cartwheels, each with many trillions of petals.

source: འདི་ནི་སྔ་ལྟས་བྱུང་བ་བཞི་པའོ།
en: This was the fourth omen.

source: །རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་དམ་པ་དེ་ན་མར་དང་། འབྲུ་མར་དང་། སྦྲང་རྩི་དང་། བུ་རམ་གྱི་དབུ་བ་དང་། ཤ་ཁ་ར་ལ་སོགས་པ་བཟའ་བའི་རྣམ་པ་གང་དག་ཡོད་པ་དེ་དག་ཀྱང་ཡོངས་སུ་སྤྱད་པས་ཟད་པར་མི་འགྱུར་ཞིང་། ཡོངས་སུ་གང་བར་སྣང་སྟེ།
en: In that sublime residence of King Śuddhodana, all the provisions of butter, sesame oil, honey, raw sugar, and sugar-cane juice were never depleted and appeared to be full even though they were used abundantly.

source: འདི་ནི་སྔ་ལྟས་བྱུང་བ་ལྔ་པའོ།
en: This was the fifth omen.

source: །རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་མཆོག་དམ་པ་དང་། བཙུན་མོའི་འཁོར་ཆེན་པོ་དག་ན་རྔ་བོ་ཆེ་དང་། རྫ་རྔ་དང་། ཁར་རྔ་དང་། རྒྱུད་གཅིག་པ་དང་། པི་བང་དང་། གླིང་བུ་དང་། རྒྱུད་གསུམ་པ་དང་། ཁར་བའི་སིལ་ཁྲོལ་དང་། ཕེག་ལ་སོགས་པ་རོལ་མོའི་ཆ་སྤྱད་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མ་བླངས་མ་དཀྲོལ་བར་ཡིད་དུ་འོང་བའི་སྒྲ་རང་སྒྲོག་པར་གྱུར་ཏེ།
en: Inside the women’s quarters of King Śuddhodana’s excellent residence, all the instruments, such as the great kettledrums, the clay and wooden kettledrums, the flutes, lutes, reed pipes, three-stringed lutes, bells, and cymbals suddenly emitted wonderful music by themselves without being played.

source: འདི་ནི་སྔ་ལྟས་བྱུང་བ་དྲུག་པའོ།
en: This was the sixth omen.

source: །རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་མཆོག་དམ་པ་ན། གསེར་དང་། དངུལ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་ལ་སོགས་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྣོད་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁ་བྱེ་ཞིང་དྲི་མ་མེད་ལ་རྣམ་པར་དག་ཅིང་རབ་ཏུ་གང་བར་སྣང་སྟེ།
en: In that most excellent residence of King Śuddhodana, all the containers of different types of precious substances, such as gold, silver, jewels, pearls, beryl, shells, crystals, and corals, opened their lids and displayed their flawless perfection and abundance.

source: འདི་ནི་སྔ་ལྟས་བྱུང་བ་བདུན་པའོ།
en: This was the seventh omen.

source: །ཉི་ཟླའི་འོད་ཟིལ་གྱིས་རླག་པར་བྱེད་ཅིང་། ལུས་དང་སེམས་དགའ་བ་སྐྱེད་པའི་འོད་དག་ཅིང་དྲི་མ་མེད་པས་སྣང་བར་གྱུར་ཏེ། འདི་ནི་སྔ་ལྟས་བྱུང་བ་བརྒྱད་པའོ།།
en: A pure and immaculate light, much brighter than those of the sun and the moon, appeared and produced mental and physical pleasure. This was the eighth omen.

source: ལྷ་མོ་སྒྱུ་འཕྲུལ་ཡང་ཁྲུས་བྱས། ལུས་བྱུག་པས་བྱུགས།
en: Queen Māyā bathed and applied perfumes to her body.

source: རྒྱན་སྣ་ཚོགས་ཀྱིས་ལག་པ་ཤིན་ཏུ་བརྒྱན་ཏེ། གོས་ཤིན་ཏུ་འཇམ་པ་མཆོག་བགོས་ཤིང་བཙུན་སྤུ་དང་བཅས་ལ།
en: She ornamented her arms with many bracelets and dressed in the softest and most beautiful garments.

source: དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། རངས་པ་ཐོབ་ནས། བུད་མེད་སྟོང་ཕྲག་བཅུས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། ལྷན་ཅིག་ཏུ་རྒྱལ་པོ་ཟས་གཙང་མ་རོལ་མོ་བྱ་བའི་ཁང་བཟངས་ན་བདེ་བར་གནས་པའི་དྲུང་དུ་ཕྱིན་ཏེ།
en: Joyful, happy, and rapturous, accompanied and encircled by ten thousand women, she went to where King Śuddhodana was seated comfortably in the music hall.

source: གཡས་རོལ་ན་ཁྲི་བཟང་པོ་རིན་པོ་ཆེའི་དྲ་བས་བརྒྱན་པ་ལ་འདུག་ནས།
en: She seated herself to his right side on the fine, precious throne draped with jeweled latticework.

source: འཛུམ་པའི་བཞིན་ཁྲོ་གཉེར་མེད་ཅིང་རབ་ཏུ་དད་པའི་མདོག་གིས་རྒྱལ་པོ་ཟས་གཙང་མ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: With a smiling and trusting face free from anger, she spoke to King Śuddhodana in these verses:

source: །རྒྱལ་པོ་ས་བདག་ལེགས་པར་བདག་ལ་གསན་དུ་གསོལ།
en: “Your Majesty, master of the earth, good lord, I pray that you hear me!

source: །རྒྱལ་པོ་ཁྱོད་ལ་གསོལ་གྱིས་བདག་ལ་དེ་གནོང་ཤིག །
en: Your Highness, please grant me a favor!

source: བདག་གི་བསམ་པ་ཡིད་ལ་ཅི་མཆིས་ཅིར་དགའ་བ། །དེ་དག་བདག་ལ་གསན་ཅིང་ཐུགས་དགྱེས་རངས་པར་མཛོད། །
en: Please listen and rejoice in your heart Concerning these wishes on which my mind is set.

source: ལྷ་བདག་བསྙེན་གནས་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་ལེན་པར་གསོལ། །བདག་ནི་འགྲོ་ལ་བྱམས་པས་ཡན་ལག་བརྒྱད་ལེན་ཏེ།
en: “Lord, out of compassion for all beings, I will adopt the eight precepts, Which include disciplined and moral conduct, as well as fasting.

source: །སྲོག་ཆགས་གནོད་པ་སྤངས་ཤིང་བསམ་པ་རྟག་དག་པས།
en: Without harming any living creature and always with pure feelings,

source: །ཇི་ལྟར་བདག་ལ་བྱམས་པ་དེ་ལྟར་གཞན་ལ་བགྱི།
en: I will love others in the same way that I love myself.

source: །རྐུ་སེམས་རྣམ་པར་སྤངས་ཏེ་འདོད་དང་དྲེགས་པ་སྤངས།
en: “I have renounced any thievish thoughts and given up attachment and arrogance;

source: །རྒྱལ་པོ་འདོད་པ་རྣམས་ལ་ལོག་པར་གཡེམ་མི་བགྱིད།
en: Your Majesty, I will not act immorally.

source: །བདེན་ལ་གནས་ཤིང་ཕྲ་མ་མ་མཆིས་ཞེ་གཅོད་སྤང་།
en: I will remain truthful, not slander others, and abandon harsh words;

source: །མི་དགེ་ཀྱལ་པའི་ཚིག་ཀྱང་ཡོངས་སུ་མི་སྤྱོད་དོ།
en: I will never use idle or nonvirtuous words.

source: །གནོད་སེམས་ཞེ་སྡང་ཐ་བ་གཏི་མུག་རྒྱགས་པ་དང་། ། བརྣབ་སེམས་ཀུན་སྤངས་རང་གི་ནོར་གྱིས་འཚལ་བར་བགྱི། །
en: “I renounce all anger, aggression, stupidity, and conceit; Renouncing all covetousness, I will be content with my own wealth.

source: ཡང་དག་སྦྱོར་བས་ཁ་གསག་ཚུལ་འཆོས་ཕྲག་དོག་སྤང་། །དགེ་བཅུའི་ལས་ལམ་འདི་དག་བདག་གིས་སྤྱད་པར་བགྱི།
en: I will act properly and renounce flattery, hypocrisy, and envy; I will travel this path of the ten virtuous actions.

source: །བདག་ནི་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་མངོན་དགའ་རབ་བསྡམས་ཀྱིས།
en: “I am joyfully engaged in strict disciplined conduct;

source: །མི་ཡི་དབང་པོ་བདག་ལ་བཞེད་པས་སྲེད་མ་མཛད།
en: So, sovereign master of men, do not act lustfully because of attraction to me.

source: །རྒྱལ་པོ་ཁྱོད་ལ་ཡུན་རིང་མི་དགེར་གྱུར་དུ་མཆི།
en: Your Majesty, may nonvirtue not arise in you for a long time;

source: །བདག་གི་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་ཉེར་གནས་དགྱེས་པར་མཛོད།
en: Please rejoice as I am nearby you in strict discipline.

source: །རྒྱལ་པོ་བདག་གི་འཚལ་བ་འདི་ལགས་དེང་མྱུར་སྩོལ།
en: “Your Highness, I beseech you, quick, say yes today!

source: །ཁང་བཟངས་བསིལ་ཁང་ལྡན་པ་དང་སྐྱ་ལྡན་པའི་ནང་།
en: Inside the cool pavilion at the top of the palace where the swans roost,

source: །མེ་ཏོག་བཀྲམ་པའི་མཆིས་མལ་འཇམ་ཞིང་དྲི་བདའ་བར།
en: On a soft and sweetly scented bed scattered with flowers,

source: །གྲོགས་མོས་རྟག་ཏུ་བསྐོར་ཅིང་བདེ་དགར་གནས་སྙམ་བགྱིད།
en: I would like to live happily, always surrounded by my female friends.

source: །སྐྱེས་པ་ཉུང་རུམ་རྣམས་དང་དེ་བཞིན་ཁྱེའུ་དག་དང་། །བུད་མེད་ཕལ་པ་རྣམས་ཀྱང་མདུན་ན་མཆིས་མི་འཚལ།
en: “May no male servants, boys, Or even common women attend me.

source: །སྙན་ཅིང་ཡིད་མཆི་སྒྲ་སྙན་ཉན་པ་མ་གཏོགས་པར།
en: May I hear only pleasant and harmonious talk,

source: །གཟུགས་དང་སྒྲ་བསུང་ཡིད་དུ་མི་མཆི་བདག་མི་འཚལ།
en: And may there be nothing unpleasant to hear or see.

source: །བཅིངས་དང་བཙོན་རར་སྩལ་བ་ཐམས་ཅད་དགྱེ་བར་གསོལ།
en: “I ask that you release all those held in prisons

source: །ནོར་གྱིས་བྲེལ་བའི་མི་རྣམས་ནོར་དང་ལྡན་པར་མཛོད།
en: And that you endow the poor with wealth.

source: །ཟས་སྐོམ་རང་པ་ཤིང་རྟ་ཁྱོགས་དང་བཞོན་པ་རྟ། །འགྲོ་ལ་བདེ་བའི་སླད་དུ་དགུང་བདུན་སྩལ་བ་མཛོད།
en: For one week, for the sake of people’s happiness, Please give food, drink, clothing, chariots, palanquins, and horses.

source: །ཕོ་བྲང་འདི་ན་སྐྱེས་པ་ཁྱེའུ་དང་བུད་མེད་དག །ཇི་སྙེད་མཆིས་པ་འཐབ་རྩོད་ཁྲོ་བའི་ཚིག་བྲལ་ཞིང་།
en: “May each and every man, woman, and child in this palace Be free from quarreling and angry words.

source: །ཕན་ཚུན་བྱམས་པའི་ཡིད་ལྡན་ཕན་དང་དེས་སེམས་ཀྱིས།
en: May their minds be full of mutual affection,

source: །དགའ་ཚལ་གནས་པའི་ལྷ་ལྟར་འཐུན་ཞིང་བདེ་སྤྱོད་མཛོད།
en: And may they enjoy themselves together, like gods in pleasure groves.

source: །རྒྱལ་པོའི་ཆད་པ་ཆེ་ཕྲ་གཉེར་གྱིས་བདའ་བ་དང་། །གནོད་པ་བགྱིད་དང་རྡེག་བཙོག་སྡིགས་རུ་མི་མཛད་པར།
en: “May no persecution, beating, or malicious threats take place. May there be no royal retribution or unjust punishment.

source: །ཀུན་ལའང་དད་པའི་ཐུགས་ཀྱིས་བྱམས་དང་ཕན་དགོངས་ཏེ། །ལྷ་ཡིས་སྐྱེ་བོ་རྣམས་ལ་སྲས་གཅིག་བཞིན་དུ་གཟིགས།
en: Lord, please look upon all beings as if upon an only child; Think benevolently and lovingly with a composed mind.”

source: །རྒྱལ་པོས་དེ་སྐད་ཚིག་ཐོས་རབ་ཏུ་དགར་གྱུར་ནས།
en: When the king heard this speech, he rejoiced and proclaimed:

source: །སྨྲས་པ་ཁྱོད་ནི་ཅི་འདོད་དེ་ཀུན་དེ་བཞིན་བྱ།
en: “Let everything you wish come to pass!

source: །ཁྱོད་ཀྱི་བསམ་པ་ཡིད་ཀྱིས་གང་རྣམས་རྗེས་བསམས་ཤིང་།
en: Whatever you seek and wish,

source: །ཁྱོད་ཀྱིས་མཆོག་བླངས་གང་ཡིན་དེ་ནི་ངས་སྦྱིན་ནོ།
en: That request I shall grant you.”

source: །རྒྱལ་པོའི་དམ་པས་རང་གི་འཁོར་ལ་བསྒོ་བ་ནི།
en: The excellent king commanded his entourage,

source: །ཁང་བཟངས་དམ་པའི་སྟེང་དུ་ཕུན་སུམ་ཚོགས་པ་ཤོམས།
en: “Make the finest preparations in the upper quarters of the palace.

source: །མེ་ཏོག་མཛེས་པ་ཁྲོམ་ལ་བདུག་སྤོས་མཆོག་གིས་བདུགས།
en: Decorate them with beautiful flowers and use the best incense and perfume;

source: །གདུགས་དང་བ་དན་ཏ་ལའི་ཕྲེང་བའི་རྒྱན་ཀྱང་གྱིས།
en: Adorn them with parasols, banners, and rows of palms trees.

source: །འཐབ་ཕོད་སྟོང་ཕྲག་ཉི་ཤུ་སྣ་ཚོགས་གོ་ཆ་ཅན།
en: “Place on guard twenty thousand brave fighting men in armor,

source: །མདའ་མདུང་ལྕགས་མདའ་མདུང་ཐུང་རལ་གྲི་ཐོགས་པ་དག །ཡིད་འོང་སྒྲ་གཅན་དང་སྐྱ་ལྡན་པ་བསྐོར་གྱིས་ཏེ།
en: Brandishing swords, arrows, spears, and lances. Let them guard the quarters where the swans call out melodiously;

source: །ལྷ་མོ་འཇིགས་པ་མེད་པར་བྱ་ཕྱིར་སྲུང་ཞིང་གནས།
en: Let them guard the queen with loving care so that she is not afraid.”

source: །ཁྲུས་བྱས་སྤོས་བྱུགས་གོས་མཆོག་དག་གིས་ཡན་ལག་བརྒྱན།
en: Bathed, perfumed, well dressed, and with her arms bejeweled,

source: །བུད་མེད་རྣམས་ཀྱིས་དེ་བསྐོར་ལྷ་ཡི་བུ་མོ་འདྲ།
en: Surrounded by her female attendants, like a goddess,

source: །ཡིད་དུ་འོང་བའི་སྒྲ་ལྡན་སིལ་སྙན་སྟོང་བླངས་ཏེ།
en: Accompanied by the pleasant sounds of thousands of cymbals,

source: །ལྷ་མོ་དེ་བཞུགས་ལྷ་ཡི་བུ་མོ་བཞིན་དུ་གནས།
en: The queen ascended and rested like a divine maiden.

source: །ལྷ་ཡི་རིན་ཆེན་རིན་ཐང་ཆེན་པོས་རྩ་སྤྲས་པ།
en: The legs of her bed were embellished with costly divine jewels;

source: །ཁྲི་ལ་གོས་མཆོག་མང་པོས་ཡིད་འོང་མལ་བཤམས་ཏེ།
en: It was a pleasing bed bestrewn with flowers.

source: །མལ་ཕྱིན་གཙུག་གི་ནོར་བུ་རིན་ཆེན་ཀློད་བྱས་ནས། །འདྲེས་པའི་ནགས་ཚལ་ལྷ་ཡི་བུ་མོ་བཞིན་དུ་གནས། །དགེ་སློང་དག་དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ལྷའི་བུ་རབ་འཐབ་བྲལ་དང་། ཡོངས་སུ་དགའ་ལྡན་དང་། རབ་འཕྲུལ་དགའ་དང་།
en: There she unfastened her tiara of precious jewels, Like a goddess in the Miśraka Garden. Monks, in the meantime the gods were gathering. There were the Four Great Kings; Śakra, lord of the gods; and the gods of Suyāma, Santuṣita, Sunirmita, and Para­nirmita­vaśa­vartin.

source: གཞན་འཕྲུལ་དབང་བྱེད་དང་། བདུད་ཀྱི་བུ་དེད་དཔོན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། མདུན་ན་འདོན་ཚངས་མཆོག་དང་། མདུན་ན་འདོན་ཚངས་བཟངས་དང་། འོད་བཀོད་པ་དང་། འོད་གསལ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་དབང་ཕྱུག་ཆེན་པོ་དང་། མཐར་ཐུག་དང་། འོག་མིན་པ་དང་། དེ་དག་ལ་སོགས་པ་དང་། གཞན་ཡང་ལྷ་བརྒྱ་སྟོང་མང་པོ་འདུས་ཏེ།
en: There were also Sārthavāha, the officer son of Māra; Brahmā, the lord of the Sahā World; the divine priest Brahmottara; the divine priest Subrahmā; and Prabhāvyūha, Ābhāsvara, Maheśvara, and the gods living in the pure realms of Niṣṭhāgata and the Highest Heaven, as well as many hundreds of thousands of others as well.

source: གཅིག་ལ་གཅིག་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: They spoke to one another in these words:

source: །གྲོགས་པོ་དག་བདག་ཅག་གིས་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་པུ་གཉིས་སུ་མེད་པར་གཤེགས་སུ་གསོལ་ན། བདག་ཅག་གིས་བྱས་པ་མ་ཤེས་པར་འགྱུར་ཏེ། བདག་ཅག་ལ་མི་ཆས།
en: “Friends, if we were to allow the Bodhisattva to depart alone, without expressing our gratitude to him, it would be inappropriate.

source: གྲོགས་པོ་དག་ཁྱེད་ཀྱི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཐོག་མ་ཡུམ་གྱི་ལྷུམས་སུ་གཤེགས་པ་དང་། ལྷུམས་ན་བཞུགས་པ་དང་། བལྟམ་པ་དང་། ཐོར་བུ་དང་། བྱིས་པའི་ནང་ན་རོལ་པ་དང་། བཙུན་མོའི་འཁོར་གྱི་ནང་ན་བཞུགས་པ་དང་། རོལ་མོ་གཟིགས་པ་དང་། མངོན་པར་འབྱུང་བ་དང་། དཀའ་བ་སྤྱོད་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གཤེགས་པ་དང་། བདུད་འདུལ་བ་དང་། བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། །མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་བསྟན་གྱི་བར་དུ་ཕན་པའི་སེམས་དང་། དགའ་བའི་སེམས་དང་། ཕངས་པའི་སེམས་དང་། བྱམས་པའི་སེམས་དང་། མཉེན་པའི་སེམས་ཀྱིས་རྟག་པར་རྒྱུན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཞབས་འབྲིང་ན་འཁོད་པར་སུ་དག་སྤྲོ།
en: Friends, who among us will have the courage to serve the Bodhisattva constantly and ceaselessly as he travels to the womb of his mother? Who will serve him as he is in the womb, when he is born, as he grows and plays as a young child? Who will serve him when he is in the female quarters watching the musical performances, and when he renounces his home and is practicing austerities? Who will serve him as he proceeds to the seat of awakening, tames the demons, attains perfect and complete awakening, and turns the wheel of the Dharma? Who will serve him until he demonstrates passing into great parinirvāṇa? Who can keep him company with a kind, affectionate, friendly, loving, and noble attitude?”

source: །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་སྨྲས་སོ།
en: Then they sang these verses:

source: །ཁྱེད་ལས་སུ་ཞིག་རྟག་ཏུ་དགའ་ཡིད་ཀྱིས།
en: “Who among us has the courage to follow joyfully

source: །གཟུགས་མཆོག་མངའ་བའི་ཞབས་འབྲིང་བྱེད་པར་སྤྲོ།
en: This being, one with such perfect appearance?

source: །སུ་དག་རང་གི་བསོད་ནམས་གཟི་བརྗིད་དང་། །སྟོབས་དང་གྲགས་པ་རྣམ་པར་སྤེལ་བར་འདོད།
en: Who would like to increase His merit, splendor, power, and renown?

source: །གང་ཞིག་ལྷ་ཡི་ཕོ་བྲང་འདི་དག་ན། །ལྷ་མོ་དག་དང་འདོད་པའི་ཡོན་ཏན་གྱི། །ལྷ་ཡི་བདེ་བས་དགའ་བར་འདོད་པ་དག །དྲི་མེད་ཟླ་བའི་ཞལ་གྱི་ཞབས་འབྲིང་གྱིས།
en: “Whoever lives in these divine palaces And wishes to enjoy the divine pleasures Of the goddesses and the divine delights, Let him serve the one with a face like an immaculate moon.

source: །དེ་བཞིན་འདྲེས་པའི་ནགས་ཚལ་མཛེས་པ་མཆོག །ལྷ་ཡི་འབྱུང་གནས་ལྷ་ཡི་ཕོ་བྲང་ན། །གསེར་མདོག་མེ་ཏོག་རྒྱས་པར་དགའ་འདོད་ན། །དྲི་མེད་གཟི་བརྗིད་མངའ་བའི་ཞབས་འབྲིང་གྱིས།
en: “Whoever wishes to enjoy the charming Miśraka Garden, With the celestial palace, the birthplace of the gods, Full of golden-hued flowers, Let him serve the immaculate brilliant one.

source: །གང་གིས་སྣ་ཚོགས་ཤིང་རྟ་དེ་བཞིན་དུ། །དགའ་ཚལ་མེ་ཏོག་མན་དཱ་ར་འདབ་རྒྱས་སུ། །ལྷ་མོ་ལྷན་ཅིག་རྩེ་བར་འདོད་པ་དག །སྐྱེས་བུ་ཆེན་པོ་འདི་ཡི་ཞབས་འབྲིང་གྱིས།
en: “Whoever wishes to frolic together with goddesses In a splendid chariot, or in the pleasure groves Carpeted with petals of māndārava flowers, Let him serve this great being.

source: །འཐབ་བྲལ་བདག་པོའམ་དགའ་ལྡན་བདག་པོའམ། །ཡང་ན་དབང་ཕྱུག་འགྱུར་བར་འདོད་པ་དང་། །འགྲོ་བ་ཀུན་གྱིས་མཆོད་འོས་འདོད་པ་དག །གྲགས་པ་མཐའ་ཡས་འདི་ཡི་ཞབས་འབྲིང་གྱིས།
en: “Whoever aspires to be the ruler of the Heaven Free from Strife Or to be the lord of the Heaven of Joy, Someone worthy of worship by all beings, Let him serve the one of unlimited renown.

source: །གང་ཞིག་འཕྲུལ་དགའི་ཁང་པ་མཛེས་པ་དང་། །དབང་སྒྱུར་ལྷ་ཡི་གནས་སུ་རྩེ་འདོད་ཅིང་།
en: “Whoever desires to enjoy himself in a beautiful mansion In the Heaven of Delighting in Emanations

source: །ཡིད་ཀྱི་འཕྲུལ་གྱིས་ཐམས་ཅད་སྤྱོད་འདོད་པ།
en: And wants to enjoy all the mentally created illusions,

source: །ཡོན་ཏན་མཆོག་མངའ་འདི་ཡི་ཞབས་འབྲིང་གྱིས།
en: Let him serve this one possessing excellent qualities.

source: །བདུད་ཀྱི་དབང་པོ་ཞེ་སྡང་ཡིད་མེད་པ།
en: “Whoever is a master over demons, but whose mind has no hatred,

source: །རྫུ་འཕྲུལ་དབང་ཕྱུག་ཀུན་གྱི་མཐར་ཕྱིན་པའི།
en: Who has attained complete mastery of all types of power,

source: །འདོད་པའི་དབང་ཕྱུག་དབང་མཐར་ཕྱིན་འདོད་ན།
en: Who is the master of his senses and has surpassed others,

source: །ཕན་པ་མཛད་པ་འདི་དང་ལྷན་ཅིག་དེང་།
en: Let him go with this benefactor.

source: །དེ་བཞིན་འདོད་པའི་ཁམས་ལས་འདའ་བྱས་ཏེ།
en: “Similarly whoever wishes to pass beyond the desire realm

source: །ཚངས་པའི་གནས་སུ་གནས་པར་སུ་འདོད་པ།
en: And reside in the realm of Brahmā,

source: །དེ་ནི་ཚད་མེད་བཞི་ཡི་གཟི་མངའ་བ། །སྐྱེས་བུ་ཆེན་པོའི་ཞབས་འབྲིང་དེང་ནས་གྱིས།
en: Let him serve today the great being Resplendent with the four immeasurables.

source: །འོན་ཏམ་གང་ཞིག་མི་ཡི་ནང་དག་ཏུ།
en: “Whoever longs to take birth among humans

source: །འཁོར་ལོས་སྒྱུར་ཡུལ་ཡངས་པར་སྐྱེ་འདོད་ན། །རིན་ཆེན་འབྱུང་གནས་མི་འཇིགས་བདེ་སྦྱིན་པ། །བསོད་ནམས་ཡངས་པ་མངའ་བའི་ཞབས་འབྲིང་གྱིས།
en: In the vast realm of a supreme universal monarch, Let him serve the One with Abundant Merit, The Jewel Mine, the One Who Bestows Fearlessness and Bliss.

source: །གང་ཞིག་ས་བདག་དེ་བཞིན་ཚོང་དཔོན་བུ། །ཕྱུག་ཅིང་སྐྱིད་ལ་ནོར་མང་ཚོགས་ཆེན་དང་། །དགྲ་ཡི་དཔུང་བཅོམ་འཁོར་དང་ལྡན་འདོད་པ། །དེ་ནི་ཕན་མཛད་འདི་དང་ལྷན་ཅིག་དེང་།
en: “Whoever wants to be a ruler or the son of a wealthy merchant, Rich and happy with great wealth, Surrounded by an army able to conquer enemies, Let him go with this benefactor.

source: །གཟུགས་དང་ལོངས་སྤྱོད་དེ་བཞིན་དབང་ཕྱུག་དང་། །སྙན་པ་གྲགས་དང་སྤོབས་དང་ཡོན་ཏན་དང་། །གཟུང་འོས་ཚིག་དང་མཉན་པའི་ཚིག་འདོད་པ། །དེ་ནི་ཚངས་དབྱངས་མཁས་པའི་གན་དུ་སོང་།
en: “Whoever desires beauty, luxuries, and power, And wishes for fame, courage, and good qualities, And would like to speak agreeably with words that are heeded, Let him attend upon that learned lord who speaks with the voice of Brahmā.

source: །ལྷ་དང་མི་ཡི་འདོད་པ་གང་ཡིན་དང་། །སྲིད་པ་གསུམ་གྱི་བདེ་བ་ཐམས་ཅད་དང་། །བསམ་གཏན་བདེ་དང་དབེན་པའི་བདེ་འདོད་པ། །དེ་ནི་ཆོས་ཀྱི་དབང་ཕྱུག་ཞབས་འབྲིང་གྱིས།
en: “Whoever desires the divine and human enjoyments, Or all the happiness of the three realms of existence, Or the bliss of concentration and the happiness in solitude, Let him follow the Dharma Lord.

source: །འདོད་ཆགས་དང་ནི་ཞེ་སྡང་སྤོང་བ་དང་། །ཉོན་མོངས་མུན་པ་སེལ་བར་སུ་འདོད་ཅིང་།
en: “Whoever yearns to abandon attachment and anger, And wants to clear away the darkness of the afflictions,

source: །ཞི་བ་རབ་ཞི་ཉེར་ཞི་ཡིད་ལྡན་པ།
en: Let him, with his mind calm, tranquil, and totally at peace,

source: །དེ་ནི་ཐུགས་དུལ་ཞབས་འབྲིང་མྱུར་དུ་སོང་།
en: Quickly follow the One Who Has Tamed His Mind.

source: །གང་ཞིག་སློབ་དང་མི་སློབ་རང་རྒྱལ་དང་། །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་འདོད་ཅིང་།
en: “Whoever wishes for the wisdom of learners, masters, and solitary buddhas, As well as the wisdom of omniscience,

source: །སྟོབས་བཅུས་སེང་གེའི་སྒྲ་སྒྲོགས་སུ་འདོད་པ།
en: And hopes to roar like a lion through the ten powers,

source: །དེ་ནི་ཡོན་ཏན་རྒྱ་མཚོ་མཁས་དྲུང་སོང་།
en: Let him follow the learned one with an ocean of qualities.

source: །གང་ཞིག་ངན་སོང་རྣམས་ཀྱི་ལམ་གཅོད་ཅིང་།
en: “Whoever desires to close the path to the lower realms,

source: །བཟང་འགྲོ་འཆི་བ་མེད་པའི་ལམ་དབྱེ་དང་། ། ཡན་ལག་བརྒྱད་ལམ་འགྲོ་བས་འགྲོ་འདོད་ན།
en: And open the path to the fortune of deathlessness, And travel on the eightfold path,

source: །འགྲོ་ལམ་མཐར་འབྱིན་འདི་ཡི་ཞབས་འབྲིང་གྱིས།
en: Let him follow the One Who Has Completed All Paths.

source: །གང་ཞིག་བདེ་གཤེགས་ཡོངས་སུ་མཆོད་པ་དང་། །ཐུགས་རྗེ་མངའ་བ་དེ་ལས་ཆོས་ཉན་དང་། །དགེ་འདུན་ཡོན་ཏན་ཐོབ་པར་འདོད་པ་ནི།
en: “Whoever wishes to make offerings to the Thus-Gone One, And listen to the Dharma from that lord of compassion, And attain the qualities of the saṅgha,

source: །ཡོན་ཏན་རྒྱ་མཚོ་འདི་ཡི་ཞབས་འབྲིང་གྱིས།
en: Let him follow this ocean of qualities.

source: །སྐྱེ་རྒ་ན་འཆིའི་སྡུག་བསྔལ་ཟད་པ་དང་། །འཁོར་བའི་བཅིངས་པ་རྣམ་པར་གྲོལ་བ་དང་། །ནམ་མཁའི་མཐའ་མཉམ་རྣམ་དག་སྤྱོད་འདོད་པ།
en: “Whoever hopes to exhaust the sufferings of birth, old age, sickness, and death, And be free from the shackles of cyclic existence, And enjoy purity equal to limitless space,

source: །དེ་ནི་སེམས་ཅན་དག་པའི་ཞབས་འབྲིང་གྱིས། །འགྲོ་བ་ཀུན་ན་ཡིད་འོང་སྡུག་མཛེས་ཤིང་།
en: Let him follow this pure being. “Whoever wishes to liberate himself as well as others,

source: །གཟུགས་མཆོག་མཚན་དང་ཡོན་ཏན་རྒྱས་པ་དང་། །བདག་དང་དེ་བཞིན་གཞན་ཡང་འགྲེལ་འདོད་པ།
en: Desiring beauty that is pleasing to all, Supreme bodily marks, and the blossoming of qualities,

source: །དེ་ནི་བལྟ་སྡུག་མཁས་པའི་གན་དུ་སོང་།
en: Let him attend the learned one who is beautiful to behold.

source: །ཚུལ་ཁྲིམས་ཏིང་འཛིན་དེ་བཞིན་ཤེས་རབ་དང་། །ཟབ་ཅིང་བལྟ་དཀའ་གཏིང་དཔག་དཀའ་བ་ཡི། །རྣམ་གྲོལ་ཐོབ་འདོད་མཁས་པ་གང་ཡིན་དེ།
en: “The learned one who wishes for Discipline, absorption, and knowledge, Who wants liberation that is profound, hard to see, and difficult to fathom,

source: །སྨན་པའི་རྒྱལ་པོའི་གན་དུ་མྱུར་དུ་སོང་།
en: Let him quickly follow the king of physicians.

source: །ཡོན་ཏན་འདི་དང་གཞན་ཡང་རྣམ་མང་དང་། །སྲིད་པའི་བདེ་དང་དེ་བཞིན་མྱ་ངན་འདས།
en: “Whoever desires many such qualities, And the happiness of existence as well as nirvāṇa,

source: །ཡོན་ཏན་ཐམས་ཅད་རབ་ཏུ་རྫོགས་འདོད་པ།
en: And wants to utterly perfect all qualities,

source: །དེ་ནི་བརྟུལ་ཞུགས་གྲུབ་མཁས་གན་དུ་སོང་།
en: Let him follow the learned one who masters disciplined conduct.”
